In [1]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import collections

In [2]:
taula = pd.read_csv('Customers.csv')

In [3]:
taula

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [4]:
taula['Profession'] = taula['Profession'].astype(str)

In [5]:
taula.dropna()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

In [6]:
taula.drop(taula[taula['Profession'] == 'nan'].index, inplace = True)

In [7]:
taula.head()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [8]:
taula.columns = ['ID', 'Genere', 'Edat', 'IngresosAnuals', 'Puntuacio', 'Professio', 'ExperienciaLaboral', 'NumFamiliar']

In [9]:
taula.head()

,ID,Genere,Edat,IngresosAnuals,Puntuacio,Professio,ExperienciaLaboral,NumFamiliar
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6

In [10]:
#1. Mostrar quins sÃ³n els clients amb el seu numero de familiars que tenen un ranking mÃ©s alt dels ingresos de la nostra tenda 
# en base a la professiÃ³ que tenen.

In [11]:
dades_agrupades = taula.groupby('Professio').apply(lambda x: x.sort_values('IngresosAnuals', ascending=False))

In [12]:
clients_top = dades_agrupades.groupby('ID').head()

In [13]:
clients_top[['ID', 'NumFamiliar', 'IngresosAnuals', 'Professio']]

                  ID  NumFamiliar  IngresosAnuals  Professio
Professio
Artist    1825  1826            6          189709     Artist
          1165  1166            1          189498     Artist
          658    659            6          189446     Artist
          921    922            6          189091     Artist
          652    653            3          189072     Artist
...              ...          ...             ...        ...
Marketing 138    139            4           22000  Marketing
          54      55            1           18000  Marketing
          212    213            4           12000  Marketing
          155    156            4           10000  Marketing
          288    289            1            5000  Marketing

[1965 rows x 4 columns]

In [14]:
# 2. Mostrar una grÃ fica de barres la mitJana dels ingressos de lâ€™empresa segons la professio.

In [15]:
dades_agrupades

                  ID  Genere  Edat  IngresosAnuals  Puntuacio  Professio  \
Professio
Artist    1825  1826    Male     7          189709         18     Artist
          1165  1166    Male    19          189498         18     Artist
          658    659  Female    31          189446         38     Artist
          921    922    Male    52          189091         12     Artist
          652    653  Female    16          189072         86     Artist
...              ...     ...   ...             ...        ...        ...
Marketing 138    139    Male    19           22000         10  Marketing
          54      55  Female    50           18000         45  Marketing
          212    213    Male    86           12000         70  Marketing
          155    156  Female    27           10000         89  Marketing
          288    289  Female    21            5000         91  Marketing

                ExperienciaLaboral  NumFamiliar
Professio
Artist    1825                   6            6
          1165                   4            1
          658                    1            6
          921                    0            6
          652                    6            3
...                            ...          ...
Marketing 138                    8            4
          54                     1            1
          212                    2            4
          155                    8            4
          288                    0            1

[1965 rows x 8 columns]

In [16]:
promigIngresosPerProfesio = clients_top[['IngresosAnuals']].groupby('Professio').mean()

In [38]:
professions = taula['Professio'].tolist()

professions.sort()

diccionari = dict(list(map(lambda x: (x,None), professions)))

#llista_claus = sorted(diccionari.keys(), key=lambda x:x.lower())

diccionari

{'Artist': None,
 'Doctor': None,
 'Engineer': None,
 'Entertainment': None,
 'Executive': None,
 'Healthcare': None,
 'Homemaker': None,
 'Lawyer': None,
 'Marketing': None}

KeyError: 0

In [18]:
promigIngresosPerProfesio

               IngresosAnuals
Professio
Artist          108776.580065
Doctor          111573.217391
Engineer        111161.240223
Entertainment   110650.333333
Executive       113770.130719
Healthcare      112574.041298
Homemaker       108758.616667
Lawyer          110995.838028
Marketing       107994.211765

In [19]:
promigIngresosPerProfesio["Artist"]

KeyError: 'Artist'

In [ ]:
promigIngresosPerProfesio.plot(kind='barh', y='Professio', x='IngresosAnuals')
plt.show()